## Import pandas Library

In [1]:
import pandas as pd

## The DataFrame

In [2]:
pd.read_csv("nba.csv")
pd.read_csv("nba.csv", parse_dates = ["Birthday"])

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [3]:
nba = pd.read_csv("nba.csv", parse_dates = ["Birthday"])

## DataFrame Attributes

In [4]:
nba.shape

(450, 5)

In [5]:
nba.size

2250

In [6]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

## Familiar Methods

In [7]:
nba.head()
nba.head(7)

             Name                   Team Position   Birthday    Salary
0    Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
1  Christian Wood        Detroit Pistons       PF 1995-09-27   1645357
2   PJ Washington      Charlotte Hornets       PF 1998-08-23   3831840
3    Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
4   Marial Shayok     Philadelphia 76ers        G 1995-07-26     79568
5  Draymond Green  Golden State Warriors       PF 1990-03-04  18539130
6   Kendrick Nunn             Miami Heat       SG 1995-08-03   1416852

In [8]:
nba.tail()
nba.tail(3)

              Name                 Team Position   Birthday    Salary
447    Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448  Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449    Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

In [9]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

## New Methods

In [10]:
nba.sample(3)

                      Name               Team Position   Birthday    Salary
393  Giannis Antetokounmpo    Milwaukee Bucks       PF 1994-12-06  25842697
172           Caleb Martin  Charlotte Hornets       SF 1995-09-28    898310
398           Jayson Tatum     Boston Celtics       PF 1998-03-03   7830000

In [11]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [12]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

## Select One or More Columns

In [13]:
nba.Name

0        Shake Milton
1      Christian Wood
2       PJ Washington
3        Derrick Rose
4       Marial Shayok
            ...
445     Austin Rivers
446       Harry Giles
447       Robin Lopez
448     Collin Sexton
449       Ricky Rubio
Name: Name, Length: 450, dtype: object

In [14]:
nba["Name"]

0        Shake Milton
1      Christian Wood
2       PJ Washington
3        Derrick Rose
4       Marial Shayok
            ...
445     Austin Rivers
446       Harry Giles
447       Robin Lopez
448     Collin Sexton
449       Ricky Rubio
Name: Name, Length: 450, dtype: object

In [15]:
nba["Team"].head()

0    Philadelphia 76ers
1       Detroit Pistons
2     Charlotte Hornets
3       Detroit Pistons
4    Philadelphia 76ers
Name: Team, dtype: object

In [16]:
nba[["Team", "Birthday"]]

nba[["Birthday", "Team"]]

      Birthday                 Team
0   1996-09-26   Philadelphia 76ers
1   1995-09-27      Detroit Pistons
2   1998-08-23    Charlotte Hornets
3   1988-10-04      Detroit Pistons
4   1995-07-26   Philadelphia 76ers
..         ...                  ...
445 1992-08-01      Houston Rockets
446 1998-04-22     Sacramento Kings
447 1988-04-01      Milwaukee Bucks
448 1999-01-04  Cleveland Cavaliers
449 1990-10-21         Phoenix Suns

[450 rows x 2 columns]

In [17]:
nba["Salary"].sum()

3444112694

In [18]:
nba["Salary"].mean()

7653583.764444444

In [19]:
nba["Salary"].median()

3303074.5

## Sort By Values in a Single Column

In [20]:
nba.sort_values("Name") # is the same as
nba.sort_values(by = "Name")

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [21]:
nba.sort_values("Name", ascending = True).head()

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [22]:
nba.sort_values("Name", ascending = False).head()

                Name                  Team Position   Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17     79568
137  Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
312     Zhaire Smith    Philadelphia 76ers       SG 1999-06-04   3058800
302     Zach Norvell    Los Angeles Lakers       SG 1997-12-09     79568
159      Zach LaVine         Chicago Bulls       PG 1995-03-10  19500000

## Sort by Values in Multiple Columns

In [23]:
nba.sort_values(by = ["Team", "Salary"], ascending = True).head()

                Name           Team Position   Birthday   Salary
197    Charlie Brown  Atlanta Hawks       SG 1997-02-02    79568
276  Brandon Goodwin  Atlanta Hawks       PG 1995-10-02    79568
438   Bruno Fernando  Atlanta Hawks        C 1998-08-15  1400000
290   Tyrone Wallace  Atlanta Hawks       PG 1994-06-10  1620564
130     Damian Jones  Atlanta Hawks        C 1995-06-30  2305057

In [24]:
nba.sort_values(by = ["Team", "Salary"], ascending = False).head()

              Name                Team Position   Birthday    Salary
251      John Wall  Washington Wizards       PG 1990-09-06  38199000
35    Bradley Beal  Washington Wizards       SG 1993-06-28  27093018
49     Ian Mahinmi  Washington Wizards        C 1986-11-05  15450051
36   Thomas Bryant  Washington Wizards        C 1997-07-31   8000000
226  Davis Bertans  Washington Wizards       PF 1992-11-12   7000000

In [25]:
nba.sort_values(by = ["Team", "Salary"], ascending = [True, False]).head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

## Review: The `inplace` Parameter

In [26]:
nba.sort_values(
    by = ["Team", "Salary"], 
    ascending = [True, False],
    inplace = True
)

In [27]:
nba.head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

## Sort DataFrame Index

In [28]:
nba = pd.read_csv(
    "nba.csv",
    parse_dates = ["Birthday"],
    index_col = "Name"
)

nba.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

In [29]:
nba.sort_index().head()
nba.sort_index(ascending = True).head()

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [30]:
nba.sort_index(ascending = False).head()

                                 Team Position   Birthday    Salary
Name
Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568
Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
Zhaire Smith       Philadelphia 76ers       SG 1999-06-04   3058800
Zach Norvell       Los Angeles Lakers       SG 1997-12-09     79568
Zach LaVine             Chicago Bulls       PG 1995-03-10  19500000

In [31]:
nba.sort_index(axis = 0).head()
nba.sort_index(axis = "index").head()

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [32]:
nba.sort_index(axis = 1).head()
nba.sort_index(axis = "columns").head()

                 Birthday Position   Salary                Team
Name
Shake Milton   1996-09-26       SG  1445697  Philadelphia 76ers
Christian Wood 1995-09-27       PF  1645357     Detroit Pistons
PJ Washington  1998-08-23       PF  3831840   Charlotte Hornets
Derrick Rose   1988-10-04       PG  7317074     Detroit Pistons
Marial Shayok  1995-07-26        G    79568  Philadelphia 76ers

In [33]:
nba.sort_index(axis = "columns", ascending = False).head()

                              Team   Salary Position   Birthday
Name
Shake Milton    Philadelphia 76ers  1445697       SG 1996-09-26
Christian Wood     Detroit Pistons  1645357       PF 1995-09-27
PJ Washington    Charlotte Hornets  3831840       PF 1998-08-23
Derrick Rose       Detroit Pistons  7317074       PG 1988-10-04
Marial Shayok   Philadelphia 76ers    79568        G 1995-07-26

## Access DataFrame Row by Index Label

In [34]:
nba.sort_index(ascending = True, axis = "index", inplace = True)
nba.sort_index(ascending = True, axis = "columns", inplace = True)
nba.head()

                    Birthday Position    Salary                   Team
Name
Aaron Gordon      1995-09-16       PF  19863636          Orlando Magic
Aaron Holiday     1996-09-30       PG   2239200         Indiana Pacers
Abdel Nader       1993-09-25       SF   1618520  Oklahoma City Thunder
Adam Mokoka       1998-07-18        G     79568          Chicago Bulls
Admiral Schofield 1997-03-30       SF   1000000     Washington Wizards

In [35]:
nba.loc["Kawhi Leonard"]

Birthday     1991-06-29 00:00:00
Position                      SF
Salary                  32742000
Team        Los Angeles Clippers
Name: Kawhi Leonard, dtype: object

In [36]:
nba.loc[["Kawhi Leonard", "Paul George"]]

                Birthday Position    Salary                  Team
Name
Kawhi Leonard 1991-06-29       SF  32742000  Los Angeles Clippers
Paul George   1990-05-02       SF  33005556  Los Angeles Clippers

In [37]:
nba.loc[["Paul George", "Kawhi Leonard"]]

                Birthday Position    Salary                  Team
Name
Paul George   1990-05-02       SF  33005556  Los Angeles Clippers
Kawhi Leonard 1991-06-29       SF  32742000  Los Angeles Clippers

## Access DataFrame Row by Index Position

In [38]:
nba.iloc[350]

Birthday    1995-10-25 00:00:00
Position                     SF
Salary                  4000000
Team            Toronto Raptors
Name: Patrick McCaw, dtype: object

In [39]:
nba.iloc[[350, 355]]

nba.iloc[[355, 350]]

                         Birthday Position   Salary               Team
Name
Quinndary Weatherspoon 1996-09-10        G    79568  San Antonio Spurs
Patrick McCaw          1995-10-25       SF  4000000    Toronto Raptors

In [40]:
# Endpoint is exclusive
nba.iloc[350:355]

                    Birthday Position    Salary                  Team
Name
Patrick McCaw     1995-10-25       SF   4000000       Toronto Raptors
Patrick Patterson 1989-03-14       PF   3068660  Los Angeles Clippers
Paul George       1990-05-02       SF  33005556  Los Angeles Clippers
Paul Millsap      1985-02-10       PF  30000000        Denver Nuggets
Quinn Cook        1993-03-23       PG   3000000    Los Angeles Lakers

In [41]:
# Endpoint is exclusive
nba.iloc[-15:-12]

                  Birthday Position   Salary              Team
Name
Wenyen Gabriel  1997-03-26       PF    79568  Sacramento Kings
Wesley Iwundu   1994-12-20       SF  1618520     Orlando Magic
Wesley Matthews 1986-10-14       SF  2564753   Milwaukee Bucks

## Select Value by Row and Column

In [42]:
nba.loc["Joel Embiid", "Salary"]

27504630

In [43]:
# Endpoint is inclusive with labels
nba.loc["Joel Embiid":"John Wall", "Salary"]

Name
Joel Embiid     27504630
John Collins     2686560
John Henson      9732396
John Konchar       79568
John Wall       38199000
Name: Salary, dtype: int64

In [44]:
# Endpoint is inclusive with labels
nba.loc["Joel Embiid", "Position":"Salary"]

Position           C
Salary      27504630
Name: Joel Embiid, dtype: object

In [45]:
# Endpoint is exclusive with labels
nba.loc["Joel Embiid":"John Wall", "Position":"Salary"]

             Position    Salary
Name
Joel Embiid         C  27504630
John Collins       PF   2686560
John Henson         C   9732396
John Konchar       SG     79568
John Wall          PG  38199000

## Reset Index

In [46]:
nba.reset_index()

                  Name   Birthday Position    Salary                   Team
0         Aaron Gordon 1995-09-16       PF  19863636          Orlando Magic
1        Aaron Holiday 1996-09-30       PG   2239200         Indiana Pacers
2          Abdel Nader 1993-09-25       SF   1618520  Oklahoma City Thunder
3          Adam Mokoka 1998-07-18        G     79568          Chicago Bulls
4    Admiral Schofield 1997-03-30       SF   1000000     Washington Wizards
..                 ...        ...      ...       ...                    ...
445        Zach LaVine 1995-03-10       PG  19500000          Chicago Bulls
446       Zach Norvell 1997-12-09       SG     79568     Los Angeles Lakers
447       Zhaire Smith 1999-06-04       SG   3058800     Philadelphia 76ers
448    Zion Williamson 2000-07-06        F   9757440   New Orleans Pelicans
449     Zylan Cheatham 1995-11-17       SF     79568   New Orleans Pelicans

[450 rows x 5 columns]

In [47]:
nba.reset_index(inplace = True)
nba.tail()

                Name   Birthday Position    Salary                  Team
445      Zach LaVine 1995-03-10       PG  19500000         Chicago Bulls
446     Zach Norvell 1997-12-09       SG     79568    Los Angeles Lakers
447     Zhaire Smith 1999-06-04       SG   3058800    Philadelphia 76ers
448  Zion Williamson 2000-07-06        F   9757440  New Orleans Pelicans
449   Zylan Cheatham 1995-11-17       SF     79568  New Orleans Pelicans

## Filtering by One Condition

In [48]:
nba["Team"] == "Los Angeles Lakers"

0      False
1      False
2      False
3      False
4      False
       ...
445    False
446     True
447    False
448    False
449    False
Name: Team, Length: 450, dtype: bool

In [49]:
nba[nba["Team"] == "Los Angeles Lakers"]

,Name,Birthday,Position,Salary,Team
8,Alex Caruso,1994-02-28,PG,2750000,Los Angeles Lakers
21,Anthony Davis,1993-03-11,C,27093019,Los Angeles Lakers
26,Avery Bradley,1990-11-26,PG,6767000,Los Angeles Lakers
87,Danny Green,1987-06-22,SG,14634147,Los Angeles Lakers
101,DeMarcus Cousins,1990-08-13,C,3500000,Los Angeles Lakers
127,Dwight Howard,1985-12-08,C,5603850,Los Angeles Lakers
180,JaVale McGee,1988-01-19,C,4000000,Los Angeles Lakers
193,Jared Dudley,1985-07-10,PF,2564753,Los Angeles Lakers
256,Kentavious Caldwell-Pope,1993-02-18,SG,8089282,Los Angeles Lakers
267,Kostas Antetokounmpo,1997-11-20,PF,79568,Los Angeles Lakers
281,LeBron James,1984-12-30,PF,37436858,Los Angeles Lakers
354,Quinn Cook,1993-03-23,PG,3000000,Los Angeles Lakers
357,Rajon Rondo,1986-02-22,PG,2564753,Los Angeles Lakers
396,Talen Horton-Tucker,2000-11-25,GF,898310,Los Angeles Lakers
421,Troy Daniels,1991-07-15,SG,2028594,Los Angeles Lakers
446,Zach Norvell,1997-12-09,SG,79568,Los Angeles Lakers

In [50]:
is_laker = nba["Team"] == "Los Angeles Lakers"
nba[is_laker].head()

                 Name   Birthday Position    Salary                Team
8         Alex Caruso 1994-02-28       PG   2750000  Los Angeles Lakers
21      Anthony Davis 1993-03-11        C  27093019  Los Angeles Lakers
26      Avery Bradley 1990-11-26       PG   6767000  Los Angeles Lakers
87        Danny Green 1987-06-22       SG  14634147  Los Angeles Lakers
101  DeMarcus Cousins 1990-08-13        C   3500000  Los Angeles Lakers

In [51]:
nba["Position"] == "PG"
is_point_guard = nba["Position"] == "PG"
nba[is_point_guard]

               Name   Birthday Position    Salary                Team
1     Aaron Holiday 1996-09-30       PG   2239200      Indiana Pacers
8       Alex Caruso 1994-02-28       PG   2750000  Los Angeles Lakers
13    Allonzo Trier 1996-01-17       PG   3551100     New York Knicks
25    Austin Rivers 1992-08-01       PG   2174310     Houston Rockets
26    Avery Bradley 1990-11-26       PG   6767000  Los Angeles Lakers
..              ...        ...      ...       ...                 ...
426  Tyrone Wallace 1994-06-10       PG   1620564       Atlanta Hawks
428      Tyus Jones 1996-05-10       PG   9258000   Memphis Grizzlies
430  Victor Oladipo 1992-05-04       PG  21000000      Indiana Pacers
442    Yogi Ferrell 1993-05-09       PG   3150000    Sacramento Kings
445     Zach LaVine 1995-03-10       PG  19500000       Chicago Bulls

[98 rows x 5 columns]

## Numeric Filtering

In [52]:
nba["Salary"] > 35000000
high_earner = nba["Salary"] > 35000000
nba[high_earner]

                  Name   Birthday Position    Salary                   Team
67          Chris Paul 1985-05-06       PG  38506482  Oklahoma City Thunder
191       James Harden 1989-08-26       PG  38199000        Houston Rockets
218          John Wall 1990-09-06       PG  38199000     Washington Wizards
257       Kevin Durant 1988-09-29       PF  37199000          Brooklyn Nets
281       LeBron James 1984-12-30       PF  37436858     Los Angeles Lakers
375  Russell Westbrook 1988-11-12       PG  38506482        Houston Rockets
390      Stephen Curry 1988-03-14       PG  40231758  Golden State Warriors

In [53]:
nba["Birthday"] < "1982-01-01"
is_older = nba["Birthday"] < "1982-01-01"
nba[is_older]

              Name   Birthday Position   Salary             Team
273    Kyle Korver 1981-03-17       PF  6004753  Milwaukee Bucks
429  Udonis Haslem 1980-06-09        C  2564753       Miami Heat
431   Vince Carter 1977-01-26       PF  2564753    Atlanta Hawks

## Filtering with Multiple Conditions (AND + OR)

In [54]:
nba["Position"] == "C"
is_center = nba["Position"] == "C"

In [55]:
nba["Team"] == "Houston Rockets"
is_rocket = nba["Team"] == "Houston Rockets"

In [56]:
nba[is_center & is_rocket]

                   Name   Birthday Position    Salary             Team
70         Clint Capela 1994-05-18        C  16896552  Houston Rockets
173  Isaiah Hartenstein 1998-05-05        C   1416852  Houston Rockets
427      Tyson Chandler 1982-10-02        C   2564753  Houston Rockets

In [57]:
nba[is_center | is_rocket]

                    Name   Birthday Position    Salary                    Team
5             Al Horford 1986-06-03        C  28000000      Philadelphia 76ers
9               Alex Len 1993-06-16        C   4160000           Atlanta Hawks
16        Andre Drummond 1993-08-10        C  27093018         Detroit Pistons
21         Anthony Davis 1993-03-11        C  27093019      Los Angeles Lakers
24           Aron Baynes 1986-12-09        C   5453280            Phoenix Suns
..                   ...        ...      ...       ...                     ...
429        Udonis Haslem 1980-06-09        C   2564753              Miami Heat
432      Vincent Poirier 1993-10-17        C   2505793          Boston Celtics
439  Willie Cauley-Stein 1993-08-18        C   2177483   Golden State Warriors
440    Willy Hernangomez 1994-05-27        C   1557250       Charlotte Hornets
444         Zach Collins 1997-11-19        C   4240200  Portland Trail Blazers

[99 rows x 5 columns]

## The `isin` Method

In [58]:
celtics = nba["Team"] == "Boston Celtics"
warriors = nba["Team"] == "Golden State Warriors"
hornets = nba["Team"] == "Charlotte Hornets"

In [59]:
nba[celtics | warriors | hornets].head()

               Name   Birthday Position    Salary                   Team
7        Alec Burks 1991-07-20       SG   2320044  Golden State Warriors
30  Bismack Biyombo 1992-08-28        C  17000000      Charlotte Hornets
37   Brad Wanamaker 1989-07-25       PG   1445697         Boston Celtics
51     Caleb Martin 1995-09-28       SF    898310      Charlotte Hornets
57   Carsen Edwards 1998-03-12       SG   1228026         Boston Celtics

In [60]:
nba["Team"].isin(["Boston Celtics", "Golden State Warriors", "Charlotte Hornets"])
target_teams = nba["Team"].isin(["Boston Celtics", "Golden State Warriors", "Charlotte Hornets"])

In [61]:
nba[target_teams].head()

               Name   Birthday Position    Salary                   Team
7        Alec Burks 1991-07-20       SG   2320044  Golden State Warriors
30  Bismack Biyombo 1992-08-28        C  17000000      Charlotte Hornets
37   Brad Wanamaker 1989-07-25       PG   1445697         Boston Celtics
51     Caleb Martin 1995-09-28       SF    898310      Charlotte Hornets
57   Carsen Edwards 1998-03-12       SG   1228026         Boston Celtics

## The `between` Method

In [62]:
one_mil_or_more = nba["Salary"] >= 1000000
two_mil_or_less = nba["Salary"] <= 2000000
nba[one_mil_or_more & two_mil_or_less].head()

                 Name   Birthday Position   Salary                   Team
2         Abdel Nader 1993-09-25       SF  1618520  Oklahoma City Thunder
4   Admiral Schofield 1997-03-30       SF  1000000     Washington Wizards
10   Alfonzo McKinnie 1992-09-17       SF  1588231    Cleveland Cavaliers
11      Alize Johnson 1996-04-22       PF  1416852         Indiana Pacers
14    Amile Jefferson 1993-05-07       PF  1339515          Orlando Magic

In [63]:
nba[nba["Salary"].between(1000000, 2000000)].head()

                 Name   Birthday Position   Salary                   Team
2         Abdel Nader 1993-09-25       SF  1618520  Oklahoma City Thunder
4   Admiral Schofield 1997-03-30       SF  1000000     Washington Wizards
10   Alfonzo McKinnie 1992-09-17       SF  1588231    Cleveland Cavaliers
11      Alize Johnson 1996-04-22       PF  1416852         Indiana Pacers
14    Amile Jefferson 1993-05-07       PF  1339515          Orlando Magic

In [64]:
nineties_kids = nba["Birthday"].between("1990-01-01", "1999-12-31")
nba[nineties_kids].head()

                Name   Birthday Position    Salary                   Team
0       Aaron Gordon 1995-09-16       PF  19863636          Orlando Magic
1      Aaron Holiday 1996-09-30       PG   2239200         Indiana Pacers
2        Abdel Nader 1993-09-25       SF   1618520  Oklahoma City Thunder
3        Adam Mokoka 1998-07-18        G     79568          Chicago Bulls
4  Admiral Schofield 1997-03-30       SF   1000000     Washington Wizards